*** FUDI output and input
    
    Sending to [[https://en.wikipedia.org/wiki/Pure_Data][Pure Data]] requires to first start pd and open or create
    a patch containing a =[netreceive 3012]= object. For testing
    purposes a =[print]= object connected to the netreceive's left
    outlet can be used. In this case watch the messages appearing in
    pd's post window, when sending FUDI messages from cm to pd using
    the code below.

    #+BEGIN_SRC lisp
      (fudi-open-default :host "127.0.0.1" :port 3012 :direction :output)

      (sprout
       (process
         repeat 2
         output (new fudi :time (now) :message '(1 2 3 4))
         wait 1))

    #+END_SRC

    Receiving FUDI also works after opening the respective stream with 

    #+BEGIN_SRC lisp
     (fudi-open-default :host "127.0.0.1" :port 3011 :direction :input)
    #+END_SRC

    #+RESULTS:
    : #<FUDI:INPUT-STREAM :TCP "127.0.0.1" 3011>

    Please refer to the common music docs for handling input events
    and establishing receivers.

